stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
/**
  ******************************************************************************
  * @file    pbp_app.c
  * @author  MCD Application Team
  * @brief   Public Broadcast Profile Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "pbp_app.h"
#include "main.h"
#include "ble_core.h"
#include "ble_audio_stack.h"
#include "stm32_seq.h"
#include "codec_mngr.h"
#include "ltv_utils.h"
#include "pbp.h"
#include "log_module.h"
#include "app_ble.h"
#include "ux_device_audio_play.h"

/* Private includes ----------------------------------------------------------*/

/* Private typedef -----------------------------------------------------------*/
typedef struct
{
  Sampling_Freq_t       Freq;
  Frame_Duration_t      FrameDuration;
  uint16_t              OctetsPerCodecFrame;
} PBPAPP_CodecConf_t;

typedef struct
{
  Sampling_Freq_t       Freq;
  uint32_t              SduInterval;
  BAP_Framing_t         Framing;
  uint16_t              MaxSDU;
  uint8_t               RTN;
  uint16_t              MaxTpLatency;
  uint32_t              PresentationDelay;
} PBPAPP_QoSConf_t;

/* Private defines -----------------------------------------------------------*/

/* Audio chain memory sizing: must be aligned with PAC (frame len) and ASEs (channels nb)
 * These macros are generic and could be overwritten by the user for a fine tuning
 */

/* Memory pool used by the codec manager to manage audio latencies
 * (8 x LC3 encoded frames (Freq, bitrate, 10ms)) per audio channel
 */
#define CODEC_POOL_SUB_SIZE                     CODEC_MAX_BAND <= CODEC_SSWB ? (480u) : (960u)

/* Audio in and out buffers used by the BSP
 * (max LC3 frame len (Freq, 10ms)) x (Max Channels Number (mono vs stereo)) x 2 (double buffer configuration)
 */
#define SAI_SRC_MAX_BUFF_SIZE                   ((CODEC_MAX_BAND <= CODEC_SSWB ? 240 : 480) * CODEC_LC3_NUM_ENCODER_CHANNEL * 2)

/* Buffers used by the LC3 codec */
#define CODEC_LC3_SESSION_DYN_ALLOC_SIZE \
        CODEC_GET_TOTAL_SESSION_BUFFER_SIZE(CODEC_LC3_NUM_SESSION, CODEC_MAX_BAND)

#define CODEC_LC3_CHANNEL_DYN_ALLOC_SIZE \
        CODEC_GET_TOTAL_ENCODER_CH_BUFFER_SIZE(CODEC_LC3_NUM_ENCODER_CHANNEL, CODEC_MAX_BAND) + \
        CODEC_GET_TOTAL_DECODER_CH_BUFFER_SIZE(CODEC_LC3_NUM_DECODER_CHANNEL, CODEC_MAX_BAND)

#define CODEC_LC3_STACK_DYN_ALLOC_SIZE \
        MAX(CODEC_LC3_NUM_ENCODER_CHANNEL > 0 ? CODEC_GET_ENCODER_STACK_SIZE(CODEC_MAX_BAND) : 0, \
            CODEC_LC3_NUM_DECODER_CHANNEL > 0 ? CODEC_GET_DECODER_STACK_SIZE(CODEC_MAX_BAND) : 0)

/* Broadcast Source Config */
#ifdef DEMO_STEREO
  #define BROADCAST_SOURCE_BAP_CONFIG             (LC3_QOS_48_4_1)
  #define BROADCAST_SOURCE_FRAME_BLOCK_PER_SDU    (1u)
  #define BROADCAST_SOURCE_NUM_BIS                (1u)
  #define BROADCAST_SOURCE_CHANNEL_ALLOC_1        (FRONT_LEFT|FRONT_RIGHT)
  #define STREAMING_AUDIO_CONTEXT                 (AUDIO_CONTEXT_MEDIA)
  #define METADATA_LEN                            (4u)
#else /* DEMO_4_LANGUAGES */
  #define BROADCAST_SOURCE_BAP_CONFIG             (LC3_QOS_16_2_1)
  #define BROADCAST_SOURCE_FRAME_BLOCK_PER_SDU    (1u)
  #define BROADCAST_SOURCE_NUM_BIS                (4u)
  #define BROADCAST_SOURCE_CHANNEL_ALLOC_1        (0x000000000) /* MONO */
  #define STREAMING_AUDIO_CONTEXT                 (AUDIO_CONTEXT_INSTRUCTIONAL)
  #define METADATA_LEN                            (9u)
#endif

/* sanity check */
#if (CODEC_LC3_NUM_ENCODER_CHANNEL != APP_NB_CHANNELS)
#warning "incorrect channel configuration"
#endif
#if (CODEC_MAX_BAND == CODEC_SSWB && ((APP_AUDIO_FREQUENCY > 24000) || (BROADCAST_SOURCE_BAP_CONFIG > LC3_QOS_24_2_1)))
#warning "incorrect frequency configuration"
#endif


#define BROADCAST_CONTROLLER_DELAY              (20000u)
#define BAP_BROADCAST_ENCRYPTION                (0u)
#define BIG_HANDLE                              (0u)
#define BAP_BROADCAST_MAX_TRANSPORT_LATENCY     (10u)

/* language in ISO 639-3 code */
#define LANGUAGE_1                              "eng"
#define LANGUAGE_2                              "jpn"
#define LANGUAGE_3                              "fra"
#define LANGUAGE_4                              "spa"

/* 0x0880 is Generic Audio Source
 * See Assigned Numbers section 2.6
 */
#define APPEARANCE                              (APPEARANCE_GENERIC_AUDIO_SOURCE)

/* Length of the aPBPAPP_BroadcastName String */
#define BROADCAST_NAME_LENGTH                   15

/* Length of the Complete Local Name String: PBP_WBA_XXXX */
#define COMPLETE_LOCAL_NAME_LENGTH              12

/* Length of the ST Manufacturer Data */
#define MANUFACTURER_DATA_LENGTH                11

#define BLE_AUDIO_DYN_ALLOC_SIZE (BLE_AUDIO_TOTAL_BUFFER_SIZE(CFG_BLE_NUM_LINK, CFG_BLE_EATT_BEARER_PER_LINK))

/*Memory required for CAP*/
#define CAP_DYN_ALLOC_SIZE CAP_MEM_TOTAL_BUFFER_SIZE(CAP_ROLE_INITIATOR,CFG_BLE_NUM_LINK, \
                                                     MAX_NUM_CIG,MAX_NUM_CIS_PER_CIG, \
                                                     MAX_NUM_UCL_SNK_ASE, \
                                                     MAX_NUM_UCL_SRC_ASE, \
                                                     0u,0u,\
                                                     0u,0u, \
                                                     0u,0u, \
                                                     0u,0u,0u, \
                                                     0u,0u)

/* Private macros ------------------------------------------------------------*/

/* Private variables ---------------------------------------------------------*/
PBPAPP_Context_t PBPAPP_Context = {0};
CAP_Config_t PBPAPP_CAP_Config = {0};
BAP_Config_t PBPAPP_BAP_Config = {0};
CCP_Config_t PBPAPP_CCP_Config = {0};
MCP_Config_t PBPAPP_MCP_Config = {0};
VCP_Config_t PBPAPP_VCP_Config = {0};
MICP_Config_t PBPAPP_MICP_Config = {0};
CSIP_Config_t PBPAPP_CSIP_Config = {0};

static uint32_t aCAPMemBuffer[DIVC(CAP_DYN_ALLOC_SIZE,4)];
static uint32_t aAudioInitBuffer[BLE_AUDIO_DYN_ALLOC_SIZE];
static BleAudioInit_t BleAudioInit;

