stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
const PBPAPP_QoSConf_t aPBPAPP_BroadcastQoSConf[NUM_LC3_QOS_CONFIG] = {
  {SAMPLE_FREQ_8000_HZ, 7500, BAP_FRAMING_UNFRAMED, 26, 2, 8, 40000},
  {SAMPLE_FREQ_8000_HZ, 10000, BAP_FRAMING_UNFRAMED, 30, 2, 10, 40000},
  {SAMPLE_FREQ_16000_HZ, 7500, BAP_FRAMING_UNFRAMED, 30, 2, 8, 40000},
  {SAMPLE_FREQ_16000_HZ, 10000, BAP_FRAMING_UNFRAMED, 40, 2, 10, 40000},
  {SAMPLE_FREQ_24000_HZ, 7500, BAP_FRAMING_UNFRAMED, 45, 2, 8, 40000},
  {SAMPLE_FREQ_24000_HZ, 10000, BAP_FRAMING_UNFRAMED, 60, 2, 10, 40000},
  {SAMPLE_FREQ_32000_HZ, 7500, BAP_FRAMING_UNFRAMED, 60, 2, 8, 40000},
  {SAMPLE_FREQ_32000_HZ, 10000, BAP_FRAMING_UNFRAMED, 80, 2, 10, 40000},
  {SAMPLE_FREQ_44100_HZ, 8163, BAP_FRAMING_FRAMED, 97, 4, 24, 40000},
  {SAMPLE_FREQ_44100_HZ, 10884, BAP_FRAMING_FRAMED, 130, 4, 31, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 75, 4, 15, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 100, 4, 20, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 90, 4, 15, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 120, 4, 20, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 117, 4, 15, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 155, 4, 20, 40000},
  {SAMPLE_FREQ_8000_HZ, 7500, BAP_FRAMING_UNFRAMED, 26, 4, 45, 40000},
  {SAMPLE_FREQ_8000_HZ, 10000, BAP_FRAMING_UNFRAMED, 30, 4, 60, 40000},
  {SAMPLE_FREQ_16000_HZ, 7500, BAP_FRAMING_UNFRAMED, 30, 4, 45, 40000},
  {SAMPLE_FREQ_16000_HZ, 10000, BAP_FRAMING_UNFRAMED, 40, 4, 60, 40000},
  {SAMPLE_FREQ_24000_HZ, 7500, BAP_FRAMING_UNFRAMED, 45, 4, 45, 40000},
  {SAMPLE_FREQ_24000_HZ, 10000, BAP_FRAMING_UNFRAMED, 60, 4, 60, 40000},
  {SAMPLE_FREQ_32000_HZ, 7500, BAP_FRAMING_UNFRAMED, 60, 4, 45, 40000},
  {SAMPLE_FREQ_32000_HZ, 10000, BAP_FRAMING_UNFRAMED, 80, 4, 60, 40000},
  {SAMPLE_FREQ_44100_HZ, 8163, BAP_FRAMING_FRAMED, 97, 4, 54, 40000},
  {SAMPLE_FREQ_44100_HZ, 10884, BAP_FRAMING_FRAMED, 130, 4, 60, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 75, 4, 50, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 100, 4, 65, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 90, 4, 50, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 120, 4, 65, 40000},
  {SAMPLE_FREQ_48000_HZ, 7500, BAP_FRAMING_UNFRAMED, 117, 4, 50, 40000},
  {SAMPLE_FREQ_48000_HZ, 10000, BAP_FRAMING_UNFRAMED, 155, 4, 65, 40000}
};

const PBPAPP_CodecConf_t aPBPAPP_CodecConf[NUM_LC3_CODEC_CONFIG] = {
  {SAMPLE_FREQ_8000_HZ, FRAME_DURATION_7_5_MS, 26u},
  {SAMPLE_FREQ_8000_HZ, FRAME_DURATION_10_MS, 30u},
  {SAMPLE_FREQ_16000_HZ, FRAME_DURATION_7_5_MS, 30u},
  {SAMPLE_FREQ_16000_HZ, FRAME_DURATION_10_MS, 40u},
  {SAMPLE_FREQ_24000_HZ, FRAME_DURATION_7_5_MS, 45u},
  {SAMPLE_FREQ_24000_HZ, FRAME_DURATION_10_MS, 60u},
  {SAMPLE_FREQ_32000_HZ, FRAME_DURATION_7_5_MS, 60u},
  {SAMPLE_FREQ_32000_HZ, FRAME_DURATION_10_MS, 80u},
  {SAMPLE_FREQ_44100_HZ, FRAME_DURATION_7_5_MS, 97u},
  {SAMPLE_FREQ_44100_HZ, FRAME_DURATION_10_MS, 130u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_7_5_MS, 75u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_10_MS, 100u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_7_5_MS, 90u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_10_MS, 120u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_7_5_MS, 117u},
  {SAMPLE_FREQ_48000_HZ, FRAME_DURATION_10_MS, 155u}
};

/* Buffers allocation for LC3*/
static uint32_t aLC3SessionMemBuffer[DIVC(CODEC_LC3_SESSION_DYN_ALLOC_SIZE,4)];
static uint32_t aLC3ChannelMemBuffer[DIVC(CODEC_LC3_CHANNEL_DYN_ALLOC_SIZE,4)];
static uint32_t aLC3StackMemBuffer[DIVC(CODEC_LC3_STACK_DYN_ALLOC_SIZE,4)];

static uint8_t aCodecPacketsMemory[MAX_CHANNEL][CODEC_POOL_SUB_SIZE];

#if (BAP_BROADCAST_ENCRYPTION == 1)
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000001, 0x00000002, 0x00000003, 0x00000004};
#else /*(BAP_BROADCAST_ENCRYPTION == 1)*/
uint32_t aPBPAPP_BroadcastCode[4u] = {0x00000000, 0x00000000, 0x00000000, 0x00000000};
#endif /*(BAP_BROADCAST_ENCRYPTION == 1)*/

#ifdef DEMO_STEREO
uint8_t aPBPAPP_BroadcastName[BROADCAST_NAME_LENGTH] = "STM32Auracast_1";
#else /* DEMO_4_LANGUAGES */
uint8_t aPBPAPP_BroadcastName[BROADCAST_NAME_LENGTH] = "STM32Language_1";
uint8_t Langage[PBP_MAX_BIS][3] = {{LANGUAGE_1}, {LANGUAGE_2}, {LANGUAGE_3}, {LANGUAGE_4}};
#endif /* DEMO_4_LANGUAGES */

/* Advertising Parameters */
BAP_Extended_Advertising_Params_t extended_adv_params = {
  0x00,          /* Advertising SID */
  96,           /* Advertising Interval min (*0.625) */
  96,           /* Adv Interval max (*0.625) */
  0x07,          /* Channel Map */
  0x00,          /* Own Address type */
  0x00,          /* Peer Address Type */
  {0,0,0,0,0,0}, /* Peer Address */
  0x7F,          /* TX Power */
  0x00,          /* Secondary Advertising Max Skip */
  0x02           /* Secondary Adv PHY */
};
BAP_Periodic_Advertising_Params_t periodic_adv_params = {
  96,  /* Advertising Interval Min */
  96,  /* Advertising Interval Max */
  0x00 /* Advertising Properties */
};

/* USB Data */
extern AUDIO_BufferTypeDef  BufferCtl;

/* Private functions prototypes-----------------------------------------------*/
static tBleStatus PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role);
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification);
static void PBPAPP_SetupBASE(uint8_t Encryption,
                             uint32_t *pBroadcastCode,
                             uint8_t MetadataLen,
                             uint8_t *pMetadata,
                             uint8_t NumBIS,
                             uint8_t BAPConfID,
                             uint32_t *pChannelAllocation,
                             uint8_t FrameBlockPerSDU);
static uint8_t PBPAPP_BuildManufacturerAvertisingData(uint8_t *pAdvData, uint8_t AdvDataLen);
static void PBPAPP_StartBroadcastAudio(Audio_Role_t role);
static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role);
static int32_t start_audio_source(void);
/* Exported functions --------------------------------------------------------*/
extern void APP_NotifyToRun(void);

/* Functions Definition ------------------------------------------------------*/
tBleStatus APP_AUDIO_STACK_Init(void)
{
  tBleStatus status;

  /* Initialize the Audio IP*/
  BleAudioInit.NumOfLinks = CFG_BLE_NUM_LINK;
  BleAudioInit.NumOfEATTBearersPerLink = CFG_BLE_EATT_BEARER_PER_LINK;
  BleAudioInit.bleAudioStartRamAddress = (uint8_t*)aAudioInitBuffer;
  BleAudioInit.total_buffer_size = BLE_AUDIO_DYN_ALLOC_SIZE;
  BleAudioInit.MaxNumOfBondedDevices = 0;
  BleAudioInit.bleAudioStartRamAddress_NVM = 0;
  BleAudioInit.total_buffer_size_NVM = 0;
  status = BLE_AUDIO_STACK_Init(&BleAudioInit);
  LOG_INFO_APP("BLE_AUDIO_STACK_Init() returns status 0x%02X\n",status);
  LOG_INFO_APP("BLE Audio Stack Lib version: %s\n",BLE_AUDIO_STACK_GetFwVersion());

