stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
  return status;
}

/**
  * @brief  Notify CAP Events
  * @param  pNotification: pointer on notification information
 */
void CAP_Notification(CAP_Notification_Evt_t *pNotification)
{
  /* Notify PBP */
  CAP_PBP_Notification(pNotification);

  /* Notify App */
  CAP_App_Notification(pNotification);
}

/**
  * @brief  Notify PBP Events
  * @param  pNotification: pointer on notification information
 */
void PBP_Notification(PBP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case PBP_PBS_BROADCAST_AUDIO_STARTED_EVT:
      {
        CAP_Broadcast_AudioStarted_Info_t *data = (CAP_Broadcast_AudioStarted_Info_t*) pNotification->pInfo;
        LOG_INFO_APP(">>== PBP_PBS_BROADCAST_AUDIO_STARTED_EVT\n");
        LOG_INFO_APP("     - Status = 0x%02X\n",pNotification->Status);
        LOG_INFO_APP("     - BIG_Handle : 0x%02x\n",BIG_HANDLE);
        if (pNotification->Status == BLE_STATUS_SUCCESS)
        {
          LOG_INFO_APP("     - Num Created BISes = %d\n",data->NumBISes);
        }
        PBPAPP_Context.current_num_bis = data->NumBISes;

        UTIL_MEM_cpy_8(&(PBPAPP_Context.current_BIS_conn_handles[0]),
                       data->pConnHandle,
                       (data->NumBISes * sizeof(uint16_t)));

        (void)PBPAPP_BroadcastSetupAudio(AUDIO_ROLE_SOURCE);
      }
      break;
    case PBP_BROADCAST_AUDIO_UP_EVT:
      {
        LOG_INFO_APP(">>== PBP_BROADCAST_AUDIO_UP_EVT\n");
        PBPAPP_Context.PBPSourceState = PBP_SOURCE_STATE_STARTED;
      }
      break;
    case PBP_BROADCAST_AUDIO_DOWN_EVT:
    {
      LOG_INFO_APP(">>== PBP_BROADCAST_AUDIO_DOWN_EVT\n");
    }
    break;


   default:
      break;
  }
  return;
}

/**
  * @brief The BLE Audio Stack requests to be executed. BLE_AUDIO_STACK_Task() shall be called.
  * @note  If the Host task is executed in a separate thread, the thread shall be unlocked here.
  */
void BLE_AUDIO_STACK_NotifyToRun(void)
{
  APP_NotifyToRun();
}

/**
  * @brief Initialize PBP Source and Start Broadcast Audio Procedure.
  */
uint8_t PBPAPP_InitSource(void)
{
  uint8_t ret = 0;
  BAP_Role_t BAP_role = 0;
  uint32_t a_channel_allocation[BROADCAST_SOURCE_NUM_BIS];
  uint8_t metadata_len = METADATA_LEN;
  uint8_t a_metadata[METADATA_LEN] = {0x03, METADATA_STREAMING_AUDIO_CONTEXTS,
                                          STREAMING_AUDIO_CONTEXT & 0xFF,
                                          (STREAMING_AUDIO_CONTEXT >> 8) & 0xFF,
#if (METADATA_LEN == 9)
                                          0x04, METADATA_LANGUAGE,
                                          0x00,  0x00,  0x00
#endif /* METADATA_LEN == 9 */
                                          };

  a_channel_allocation[0] = BROADCAST_SOURCE_CHANNEL_ALLOC_1;
#if (BROADCAST_SOURCE_NUM_BIS == 2)
  a_channel_allocation[1] = BROADCAST_SOURCE_CHANNEL_ALLOC_2;
#endif /* (BROADCAST_SOURCE_NUM_BIS == 2) */

#if (APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1)
  /* this role is mandatory in this project */
  BAP_role = BAP_ROLE_BROADCAST_SOURCE;
#endif /* (APP_BAP_ROLE_BROADCAST_SOURCE_SUPPORT == 1) */

  LOG_INFO_APP(">>==  Start CAP Initiator initialization\n");
  ret = PBPAPP_Init(APP_CAP_ROLE, BAP_role);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : PBPAPP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: PBPAPP_Init() function\n");
  }

  /*Enable Audio Codec in LE Controller */
  PBPAPP_Context.aStandardCodec[0].CodingFormat = AUDIO_CODING_FORMAT_LC3;
  PBPAPP_Context.aStandardCodec[0].TransportMask = 0x02; /*BIS Transport Type only*/
  PBPAPP_Context.AudioCodecInController.NumStandardCodecs = 0x01;
  PBPAPP_Context.AudioCodecInController.pStandardCodec = &PBPAPP_Context.aStandardCodec[0];
  PBPAPP_Context.AudioCodecInController.NumVendorSpecificCodecs = 0x00;
  PBPAPP_Context.AudioCodecInController.pVendorSpecificCodec = (void *)0;

  ret = CAP_EnableAudioCodecController(&PBPAPP_Context.AudioCodecInController);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_EnableAudioCodecController() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_EnableAudioCodecController() function\n");
  }

  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_HEADSET;

  PBPAPP_SetupBASE(BAP_BROADCAST_ENCRYPTION,
                   aPBPAPP_BroadcastCode,
                   metadata_len,
                   a_metadata,
                   BROADCAST_SOURCE_NUM_BIS,
                   BROADCAST_SOURCE_BAP_CONFIG,
                   a_channel_allocation,
                   BROADCAST_SOURCE_FRAME_BLOCK_PER_SDU);

#ifdef DEMO_STEREO
  if (aPBPAPP_CodecConf[BROADCAST_SOURCE_BAP_CONFIG%16].Freq == SAMPLE_FREQ_48000_HZ
     && (BROADCAST_SOURCE_NUM_BIS == 2
       || LTV_GetNumberOfChannelsSet(BROADCAST_SOURCE_CHANNEL_ALLOC_1) == 2))
  {
    /* Reduce RTN */
    PBPAPP_Context.RTN = 1;
  }
#else /* DEMO_4_LANGUAGES */
  PBPAPP_Context.RTN = 2; // force RTN
  PBPAPP_Context.max_transport_latency = BAP_BROADCAST_MAX_TRANSPORT_LATENCY;//force max transport latency
#endif

  ret = PBP_Init(PBP_ROLE_PUBLIC_BROADCAST_SOURCE);

  LOG_INFO_APP(">>==  End CAP Initiator initialization\n");
  return ret;
}

/**
  * @brief   Start PBP Source
  */
uint8_t PBPAPP_StartSource(void)
{
  uint8_t ret;
  uint8_t a_additional_adv_data[COMPLETE_LOCAL_NAME_LENGTH + 2 + MANUFACTURER_DATA_LENGTH + 1] = \
                                                                                    {COMPLETE_LOCAL_NAME_LENGTH + 1,
                                                                                    AD_TYPE_COMPLETE_LOCAL_NAME};
  PBP_PBS_BroadcastAudioStart_Params_t pbp_audio_start_params;
  CAP_Broadcast_AudioStart_Params_t cap_audio_start_params;
  char broadcast_name_string[BROADCAST_NAME_LENGTH+1];
  char source_id_string[COMPLETE_LOCAL_NAME_LENGTH+1];

  uint8_t Pb_Addr_Len;
  uint8_t Pb_Addr[6] = {0x00};

  aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &Pb_Addr_Len, &Pb_Addr[0]);
  snprintf(source_id_string, COMPLETE_LOCAL_NAME_LENGTH+1, "PBP_WBA_%02X%02X", Pb_Addr[1], Pb_Addr[0]);
  MEMCPY(&a_additional_adv_data[2], source_id_string, COMPLETE_LOCAL_NAME_LENGTH);

  snprintf(broadcast_name_string, BROADCAST_NAME_LENGTH+1, "%s", aPBPAPP_BroadcastName);

  /* enable ISO cohabitation scheduling mode for extended advertising */
  const uint8_t iso_ext_adv_schl = 1;
  aci_write_config_data(CONFIG_DATA_LL_ISO_SCHED_MODE_OFFSET, 1, &iso_ext_adv_schl);

