stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
  /* enable scheduling of the radio calibration from ISR context to avoid conflicts with app tasks */
  ll_intf_le_set_phy_clbr_context(PHY_CALIBRATION_CONTEXT_ISR);

  pbp_audio_start_params.pBroadcastAudioStartParams = &cap_audio_start_params;
  pbp_audio_start_params.StandardQuality = 0;
  pbp_audio_start_params.HighQuality = 0;
  pbp_audio_start_params.pAdvMetadata = 0;
  pbp_audio_start_params.AdvMetadataLen = 0;
  pbp_audio_start_params.pBroadcastName = &aPBPAPP_BroadcastName[0];
  pbp_audio_start_params.BroadcastNameLen = BROADCAST_NAME_LENGTH;
  pbp_audio_start_params.Appearance = APPEARANCE;

  cap_audio_start_params.pBaseGroup = &PBPAPP_Context.base_group;
  cap_audio_start_params.BigHandle = 0;

  /* Generate Random Broadcast ID */
  HW_RNG_Get(1, &cap_audio_start_params.BroadcastId);
  /* Reduce broadcast id on 3 bytes */
  cap_audio_start_params.BroadcastId &= 0x00FFFFFF;

  cap_audio_start_params.Rtn = PBPAPP_Context.RTN;
  cap_audio_start_params.Phy = 0x02;
  cap_audio_start_params.Packing = BAP_PACKING_SEQUENTIAL;
  cap_audio_start_params.MaxTransportLatency = PBPAPP_Context.max_transport_latency;
  cap_audio_start_params.Encryption = PBPAPP_Context.encryption;
  cap_audio_start_params.pBroadcastCode = &PBPAPP_Context.broadcast_code[0];
  cap_audio_start_params.AdvHandle = 0;
  cap_audio_start_params.pExtendedAdvParams = &extended_adv_params;
  cap_audio_start_params.pPeriodicAdvParams = &periodic_adv_params;
  cap_audio_start_params.pAdditionalAdvData = &a_additional_adv_data[0];
  cap_audio_start_params.AdditionalAdvDataLen = 18;

  if (BROADCAST_SOURCE_BAP_CONFIG%16 == 3 || BROADCAST_SOURCE_BAP_CONFIG%16 == 5)
  {
    pbp_audio_start_params.StandardQuality = 1u;
  }
  else if (BROADCAST_SOURCE_BAP_CONFIG%16 >= 10)
  {
    pbp_audio_start_params.HighQuality = 1u;
  }

  cap_audio_start_params.AdditionalAdvDataLen += PBPAPP_BuildManufacturerAvertisingData(
                                                 &(a_additional_adv_data[cap_audio_start_params.AdditionalAdvDataLen]),
                                                 MANUFACTURER_DATA_LENGTH);

  LOG_INFO_APP("  Start Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStart(&pbp_audio_start_params);

  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : PBP_PBS_BroadcastAudioStart() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: PBP_PBS_BroadcastAudioStart() function\n");
  }

  return ret;
}

/**
  * @brief   Stop PBP Source
  */
uint8_t PBPAPP_StopSource(void)
{
  uint8_t ret;

  LOG_INFO_APP("  Stop Broadcast Audio\n");
  ret = PBP_PBS_BroadcastAudioStop(BIG_HANDLE, 1);

  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : PBP_PBS_BroadcastAudioStop() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: PBP_PBS_BroadcastAudioStop() function\n");
  }

  return ret;
}

/**
  * @brief Called by TIM17 interrupt to send a new frame to the codec
  * @param None
 */
void APP_NotifyFrameCplt(void)
{
  uint8_t i;

  if (BufferCtl.frame < 2)
  {
    /* Skip first frames */
    BufferCtl.frame++;
    return;
  }

  if (PBPAPP_Context.bap_role & BAP_ROLE_BROADCAST_SOURCE)
  {
    for (i = 0; i< PBPAPP_Context.current_num_bis; i++)
    {
      CODEC_SendData(PBPAPP_Context.current_BIS_conn_handles[i], 1, &BufferCtl.buff[BufferCtl.rd_ptr] + 2*i);
    }

    /* Increment read pointer */
    if (BufferCtl.rd_ptr + PCM_AUDIO_BUF_SIZE < USB_AUDIO_BUF_SIZE)
    {
      BufferCtl.rd_ptr += PCM_AUDIO_BUF_SIZE;
    }
    else
    {
      /* Roll back read pointer */
      BufferCtl.rd_ptr = 0;
    }

#if (CFG_LED_SUPPORTED == 1)
    Set_Auracast_State(AURACAST_STATE_STREAMING);
#endif /* (CFG_LED_SUPPORTED == 1) */

    /* Compute feedback */
    USBD_ComputeUSBFeedback();
  }
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
/**
  * @brief  Notify CAP Events for App
  * @param  pNotification: pointer on notification information
 */
static void CAP_App_Notification(CAP_Notification_Evt_t *pNotification)
{
  switch (pNotification->EvtOpcode)
  {
    case CAP_AUDIO_CLOCK_REQ_EVT:
    {
      LOG_INFO_APP(">>== CAP_AUDIO_CLOCK_REQ_EVT\n");
      Sampling_Freq_t *freq = (Sampling_Freq_t *)pNotification->pInfo;
      LOG_INFO_APP("     - Sample Frequency Type:   0x%02X\n",*freq);
      LOG_INFO_APP("==>> Audio Clock with Sample Frequency Type 0x%02X Initialization\n",*freq);
      AudioClock_Init(*freq);
      break;
    }

    default:
      break;
  }
}

static uint8_t PBPAPP_Init(CAP_Role_t CAP_Role, BAP_Role_t BAP_Role)
{
  tBleStatus ret = 0;

  /*Clear the CAP Configuration*/
  memset(&PBPAPP_CAP_Config,0,sizeof(PBPAPP_CAP_Config));

  /*Clear the BAP Configuration*/
  memset(&PBPAPP_BAP_Config,0,sizeof(PBPAPP_BAP_Config));

  /*Clear the CCP Configuration*/
  memset(&PBPAPP_CCP_Config,0,sizeof(CCP_Config_t));

  /*Clear the MCP Configuration*/
  memset(&PBPAPP_MCP_Config,0,sizeof(MCP_Config_t));

  /*Clear the VCP Configuration*/
  memset(&PBPAPP_VCP_Config,0,sizeof(VCP_Config_t));

  /*Clear the MICP Configuration*/
  memset(&PBPAPP_MICP_Config,0,sizeof(MICP_Config_t));

  /*Clear the CSIP Configuration*/
  memset(&PBPAPP_CSIP_Config,0,sizeof(CSIP_Config_t));

  PBPAPP_CAP_Config.Role = CAP_Role;
  PBPAPP_CAP_Config.MaxNumLinks = CFG_BLE_NUM_LINK;

  PBPAPP_CAP_Config.pStartRamAddr = (uint8_t *)&aCAPMemBuffer;
  PBPAPP_CAP_Config.RamSize = CAP_DYN_ALLOC_SIZE;

  PBPAPP_BAP_Config.Role = BAP_Role;

  PBPAPP_BAP_Config.MaxNumBleLinks = CFG_BLE_NUM_LINK;

  /*Isochronous Channels Configuration*/
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumCISPerCIG = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBIG = MAX_NUM_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.MaxNumBISPerBIG = MAX_NUM_BIS_PER_BIG;
  PBPAPP_BAP_Config.ISOChnlConfig.pStartRamAddr = 0;
  PBPAPP_BAP_Config.ISOChnlConfig.RamSize = 0u;

  /* Initialize the Basic Audio Profile*/
  ret = CAP_Init(&PBPAPP_CAP_Config,
                 &PBPAPP_BAP_Config,
                 &PBPAPP_VCP_Config,
                 &PBPAPP_MICP_Config,
                 &PBPAPP_CCP_Config,
                 &PBPAPP_MCP_Config,
                 &PBPAPP_CSIP_Config);
  if (ret != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("  Fail   : CAP_Init() function, result: 0x%02X\n", ret);
  }
  else
  {
    LOG_INFO_APP("  Success: CAP_Init() function\n");
  }
  if (ret == BLE_STATUS_SUCCESS)
  {

    /*Initialize the Audio Codec (LC3)*/
    CODEC_LC3Config_t lc3_config = {0};
    PBPAPP_Context.bap_role = PBPAPP_BAP_Config.Role;

    /*Register the Audio Task */
    UTIL_SEQ_RegTask( 1<<CFG_TASK_AUDIO_ID, UTIL_SEQ_RFU, BLE_AUDIO_STACK_Task);

    lc3_config.SessionSize = sizeof(aLC3SessionMemBuffer);
    lc3_config.ChannelSize = sizeof(aLC3ChannelMemBuffer);
    lc3_config.StackSize = sizeof(aLC3StackMemBuffer);

    lc3_config.pSessionStart = aLC3SessionMemBuffer;
    lc3_config.pChannelStart = aLC3ChannelMemBuffer;
    lc3_config.pStackStart = aLC3StackMemBuffer;

    CODEC_ManagerInit(sizeof(aCodecPacketsMemory),
                      (uint8_t*)aCodecPacketsMemory,
                      &lc3_config,
                      CODEC_PROC_MARGIN_US,
                      CODEC_RF_SETUP_US,
                      CODEC_MODE_DEFAULT);
  }
  return ret;
}


