stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
/*
 * BASE composition
 *
 * Group
 * `-- Subgroup [metadata: content=media]
 *     |-- BIS [channel=right]
 *     `-- BIS [channel=left]
 *
 *
 * Group
 * |-- Subgroup [metadata: content=conversational language=eng]
 * |   `-- BIS [channel=mono]
 * |-- Subgroup [metadata: content=conversational language=jpn]
 * |   `-- BIS [channel=mono]
 * |-- Subgroup [metadata: content=conversational language=fra]
 * |   `-- BIS [channel=mono]
 * `-- Subgroup [metadata: content=conversational language=spa]
 *     `-- BIS [channel=mono]
 *
 */
static void PBPAPP_SetupBASE(uint8_t Encryption,
                             uint32_t *pBroadcastCode,
                             uint8_t MetadataLen,
                             uint8_t *pMetadata,
                             uint8_t NumBIS,
                             uint8_t BAPConfID,
                             uint32_t *pChannelAllocation,
                             uint8_t FrameBlockPerSDU)
{
  uint8_t i, j;
  uint8_t num_bis_per_subgrp;

  /* Init Broadcast Source Configuration */
  PBPAPP_Context.audio_driver_config = AUDIO_DRIVER_CONFIG_LINEIN;
  PBPAPP_Context.phy = TARGET_LE_2M_PHY;

  PBPAPP_Context.encryption = Encryption;
  PBPAPP_Context.broadcast_code[0] = pBroadcastCode[0];
  PBPAPP_Context.broadcast_code[1] = pBroadcastCode[1];
  PBPAPP_Context.broadcast_code[2] = pBroadcastCode[2];
  PBPAPP_Context.broadcast_code[3] = pBroadcastCode[3];

  PBPAPP_Context.RTN = aPBPAPP_BroadcastQoSConf[BAPConfID].RTN;
  PBPAPP_Context.max_transport_latency = aPBPAPP_BroadcastQoSConf[BAPConfID].MaxTpLatency;
  PBPAPP_Context.base_group.PresentationDelay = aPBPAPP_BroadcastQoSConf[BAPConfID].PresentationDelay;

  /* when this app is build for N subgroups, the codec configuration is the same for each subgroups,
    so we can avoid to duplicate this memory at the application level */
  uint8_t codec_conf_subgrp_idx = 0;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = CODEC_SAMPLING_FREQ;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = aPBPAPP_CodecConf[BAPConfID%16].Freq;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = CODEC_FRAME_DURATION;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = aPBPAPP_CodecConf[BAPConfID%16].FrameDuration;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = 0x03;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = CODEC_OCTETS_PER_CODEC_FRAME;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = (uint8_t) aPBPAPP_CodecConf[BAPConfID%16].OctetsPerCodecFrame;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = (uint8_t) (aPBPAPP_CodecConf[BAPConfID%16].OctetsPerCodecFrame >> 8);

  /* optionnal config */
  /*PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = 0x02;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = CODEC_FRAMES_BLOCKS_PER_SDU;
  PBPAPP_Context.codec_specific_config_subgroup[0][codec_conf_subgrp_idx++] = FrameBlockPerSDU;*/

#ifdef DEMO_STEREO
  PBPAPP_Context.base_group.NumSubgroups = 1;
  PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);
  num_bis_per_subgrp = NumBIS;
#else /* DEMO_4_LANGUAGES */
  PBPAPP_Context.base_group.NumSubgroups = NumBIS;
  PBPAPP_Context.base_group.pSubgroups = &(PBPAPP_Context.base_subgroups[0]);
  num_bis_per_subgrp = 1;
#endif

  for (i = 0; i < PBPAPP_Context.base_group.NumSubgroups; i++)
  {
    PBPAPP_Context.base_subgroups[i].NumBISes = num_bis_per_subgrp;
    PBPAPP_Context.base_subgroups[i].CodecID = AUDIO_CODING_FORMAT_LC3;
    PBPAPP_Context.base_subgroups[i].CodecSpecificConfLength = codec_conf_subgrp_idx;
    PBPAPP_Context.base_subgroups[i].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_subgroup[0][0]); /* same config for each subgroups */

    PBPAPP_Context.base_subgroups[i].pMetadata = &PBPAPP_Context.subgroup_metadata[i][0];
    PBPAPP_Context.base_subgroups[i].MetadataLength = MetadataLen;

#ifndef DEMO_STEREO
    /* update metadata for each subgroup by adding language */
    if ((MetadataLen == 9) && (pMetadata[5] == METADATA_LANGUAGE))
    {
      pMetadata[6] = Langage[i][0];
      pMetadata[7] = Langage[i][1];
      pMetadata[8] = Langage[i][2];
    }
#endif

    UTIL_MEM_cpy_8(PBPAPP_Context.subgroup_metadata[i], pMetadata, MetadataLen);

    for (j = 0; j < num_bis_per_subgrp; j++)
    {
      uint8_t codec_conf_bis_idx = 0;

      /* in this app, codec config for BIS is duplicated for each subgroups */
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = 0x05;
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = CODEC_AUDIO_CHNL_ALLOCATION;
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = (pChannelAllocation[j]) & 0xFF;
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = (pChannelAllocation[j] >> 8) & 0xFF;
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = (pChannelAllocation[j] >> 16) & 0xFF;
      PBPAPP_Context.codec_specific_config_bis[j][codec_conf_bis_idx++] = (pChannelAllocation[j] >> 24) & 0xFF;

      PBPAPP_Context.base_bis[i*num_bis_per_subgrp+j].BIS_Index = i*num_bis_per_subgrp+j+1;
      PBPAPP_Context.base_bis[i*num_bis_per_subgrp+j].CodecSpecificConfLength = codec_conf_bis_idx;
      PBPAPP_Context.base_bis[i*num_bis_per_subgrp+j].pCodecSpecificConf = &(PBPAPP_Context.codec_specific_config_bis[j][0]);
    }
    PBPAPP_Context.base_subgroups[i].pBIS = &(PBPAPP_Context.base_bis[i*num_bis_per_subgrp]);
  }
}

static uint8_t PBPAPP_BuildManufacturerAvertisingData(uint8_t *pAdvData, uint8_t AdvDataLen)
{
  if (AdvDataLen >= MANUFACTURER_DATA_LENGTH + 1)
  {
    uint8_t bd_addr[6];
    uint8_t length;

    /* Length */
    pAdvData[0] = MANUFACTURER_DATA_LENGTH;

    /* Type: Manufacturer Data */
    pAdvData[1] = 0xFF;

    /* ST Company ID */
    pAdvData[2] = 0x30;
    pAdvData[3] = 0x00;

