stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/NUCLEO-WBA65RI/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/STM32_WPAN/App/pbp_app.c
    /* BlueSTSDK protocol version */
    pAdvData[4] = 0x02;

    /* Board ID: Discovery Kit WBA */
    pAdvData[5] = 0x8C;

    /* Firmware ID: Public Broadcast Source */
    pAdvData[6] = 0x90;

    /* BD Address */
    aci_hal_read_config_data(CONFIG_DATA_PUBADDR_OFFSET, &length, &(bd_addr[0]));
    pAdvData[7] = bd_addr[0];
    pAdvData[8] = bd_addr[1];
    pAdvData[9] = bd_addr[2];
    pAdvData[9] = bd_addr[3];
    pAdvData[10] = bd_addr[4];
    pAdvData[11] = bd_addr[5];

    return MANUFACTURER_DATA_LENGTH + 1;
  }
  else
  {
    /* Advertising Data size insufficient */
    return 0;
  }
}

static void PBPAPP_StartBroadcastAudio(Audio_Role_t role)
{
  if (role == AUDIO_ROLE_SOURCE)
  {
    CODEC_RegisterTriggerClbk(DATA_PATH_SAMPLE_CIRC_BUF, DATA_PATH_INPUT, &start_audio_source);
  }
}

static tBleStatus PBPAPP_BroadcastSetupAudio(Audio_Role_t role)
{
  Sampling_Freq_t sampling_freq;
  Frame_Duration_t frame_duration;
  uint8_t direction = DATA_PATH_INPUT;
  uint32_t controller_delay;
  uint32_t controller_delay_min = 0;
  uint32_t controller_delay_max = 0;
  uint8_t a_codec_id[5] = {0x00,0x00,0x00,0x00,0x00};
  tBleStatus ret;

  LOG_INFO_APP("==>> Start PBPAPP_BroadcastSetupAudio function\n");

  a_codec_id[0] = AUDIO_CODING_FORMAT_LC3;

  sampling_freq = LTV_GetConfiguredSamplingFrequency(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  frame_duration = LTV_GetConfiguredFrameDuration(
      &PBPAPP_Context.base_group.pSubgroups[0].pCodecSpecificConf[0],
      PBPAPP_Context.base_group.pSubgroups[0].CodecSpecificConfLength);

  if ((sampling_freq != 0) && (frame_duration != 0xFF))
  {
    PBPAPP_StartBroadcastAudio(role);

    /* AUDIO_ROLE_SOURCE */
    direction = DATA_PATH_INPUT;
    CAP_Broadcast_ReadSupportedControllerDelay(PBPAPP_Context.current_num_bis,
                                               direction,
                                               a_codec_id,
                                               &controller_delay_min,
                                               &controller_delay_max);

    /* at source we don't have to respect a presentation delay */
    if ((controller_delay_min <= BROADCAST_CONTROLLER_DELAY) \
      && (controller_delay_max > BROADCAST_CONTROLLER_DELAY))
    {
      controller_delay = BROADCAST_CONTROLLER_DELAY;
    }
    else if (controller_delay_min > BROADCAST_CONTROLLER_DELAY)
    {
      controller_delay = controller_delay_min;
    }
    else /* (info->ControllerDelayMax < BROADCAST_CONTROLLER_DELAY) */
    {
      controller_delay = controller_delay_max;
    }
    LOG_INFO_APP("Controller delay chosen to value %d us\n", controller_delay);

    CODEC_DataPathSampleParam_t param;
    /* sample coded on 16bits */
    param.SampleDepth = 16;

    /* depends on sample organization in the PCM buffer */
    param.Decimation = APP_NB_CHANNELS;

    ret = CAP_Broadcast_SetupAudioDataPath(PBPAPP_Context.current_num_bis,
                                            &PBPAPP_Context.current_BIS_conn_handles[0],
                                            direction,
                                            a_codec_id,
                                            controller_delay,
                                            DATA_PATH_SAMPLE_CIRC_BUF,
                                            CONFIGURE_DATA_PATH_SAMPLE_LEN,
                                            (const uint8_t*) &param);

    if (ret != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("  Fail   : CAP_Broadcast_SetupAudioDataPath() function, result: 0x%02X\n", ret);
    }
    else
    {
      LOG_INFO_APP("  Success: CAP_Broadcast_SetupAudioDataPath() function\n");
    }
  }
  else
  {
    LOG_INFO_APP("Sampling Frequency in LTV is invalid\n");
    ret = BLE_STATUS_FAILED;
  }
  LOG_INFO_APP("==>> End PBPAPP_BroadcastSetupAudio function\n");
  return ret;
}

/* Audio Source */
static int32_t start_audio_source(void)
{
  return Start_RxAudio();
}

